<br><br><font size=6><b>Project 3: </b></font><font size=6>Part 3 - <span style="color:#88618A;font-size:29px;">Extract Transform Load</span></font>

<font size=3><ul><li>Suganthan Thamotharampillai<br><li>02.16.2023</li></font>

<br><font size=5><b>Imports

In [1]:
# LIBRARIES
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os, json
from sqlalchemy.types import *

<br><font size=5><b>Data

In [2]:
# Load in Data
title_genres = pd.DataFrame()
title_basics = pd.read_csv("Data/title_basics.csv.gz")
title_ratings =pd.read_csv("Data/title_ratings.csv.gz")
tmdb_data    = pd.read_csv("Data/tmdb_results_combined.csv.gz")

<br><br><b><font style="font-size:23px;"><u>EXTRACT</font>
<br><br><font size=5><b>Data Overview

In [4]:
# DATAFRAMES
title_genres[['tconst','genre_id']] = title_basics[['tconst', 'genres']]
title_basics = title_basics[['tconst', 'primaryTitle','startYear', 'runtimeMinutes']]
title_ratings = title_ratings[['tconst', 'averageRating','numVotes']]
tmdb_data = tmdb_data[['imdb_id','revenue', 'budget', 'certification']]

# Display
display(title_basics.head())
display(title_ratings.head())
display(title_genres.head())
display(tmdb_data.head())

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

      tconst  averageRating  numVotes
0  tt0000001            5.7      1949
1  tt0000002            5.8       264
2  tt0000005            6.2      2583
3  tt0000006            5.1       177
4  tt0000007            5.4       810

      tconst                genre_id
0  tt0035423  Comedy,Fantasy,Romance
1  tt0062336                   Drama
2  tt0069049                   Drama
3  tt0088751    Comedy,Horror,Sci-Fi
4  tt0096056                   Drama

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0118694  12854953.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0120263     80334.0         0.0           NaN
4  tt0120467     14904.0    120000.0             R

<br><br><b><font style="font-size:23px;"><u>TRANSFORM</font>
<br><br><font size=5><b>Normalization

<b>First Normal Form:</b> Each column in a table can only have one piece of information
    <ul>
    <li>title_basics 'genres' column contains several pieces of information
    <li>title_basics 'genres' column violates the first normal form
    <li>title_basics 'genres' column will be converted into two separate tables

<b><font size=3>New Tables: '<span style="color:#83537E"> title_genres'</span> & <span style="color:#83537E"> 'gneres'</span>

<b>TABLE: title_genres

<b>1. Setup gnere_id

In [5]:
# TABLE:'title_gneres'
title_genres.head()

      tconst                genre_id
0  tt0035423  Comedy,Fantasy,Romance
1  tt0062336                   Drama
2  tt0069049                   Drama
3  tt0088751    Comedy,Horror,Sci-Fi
4  tt0096056                   Drama

<b>2. Convert 'gnere' from 'string' to ['list']

In [6]:
# Convert 'string' column to 'list'
title_genres['genre_id'] = title_genres['genre_id'].str.split(',')
title_genres.head()

      tconst                    genre_id
0  tt0035423  [Comedy, Fantasy, Romance]
1  tt0062336                     [Drama]
2  tt0069049                     [Drama]
3  tt0088751    [Comedy, Horror, Sci-Fi]
4  tt0096056                     [Drama]

<b>3. Explode 'gnere' column

In [7]:
# Use EXPLODE to populate genres and count unique values
title_genres = title_genres.explode('genre_id')
title_genres

          tconst   genre_id
0      tt0035423     Comedy
0      tt0035423    Fantasy
0      tt0035423    Romance
1      tt0062336      Drama
2      tt0069049      Drama
...          ...        ...
85006  tt9916190     Action
85006  tt9916190  Adventure
85006  tt9916190   Thriller
85007  tt9916362      Drama
85007  tt9916362    History

[158833 rows x 2 columns]

<b>4. Get Unique Values

In [9]:
# Get Unique Values
unique = sorted(title_genres['genre_id'].unique())

# Unique Values
for i in range(len(unique)): print(unique[i])

Action
Adult
Adventure
Animation
Biography
Comedy
Crime
Drama
Family
Fantasy
Game-Show
History
Horror
Music
Musical
Mystery
News
Reality-TV
Romance
Sci-Fi
Short
Sport
Talk-Show
Thriller
War
Western

<b>5. Create Mapper Dictionary

In [10]:
## Making the genre mapper dictionary
mapper = dict(zip(unique, range(len(unique))))
mapper

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

<b>6. Map string genre_id with integer

In [11]:
## Make integer genre_id
title_genres['genre_id'] = title_genres['genre_id'].map(mapper)
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
85006  tt9916190         0
85006  tt9916190         2
85006  tt9916190        23
85007  tt9916362         7
85007  tt9916362        11

[158833 rows x 2 columns]

<br><b>TABLE: genres<br><b>Convert the genre map dictionary into a dataframe

In [12]:
# TABLE:'genres'
genres = pd.DataFrame({'genre_id':mapper.values(),
                       'genre_name':mapper.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

<br><br><b><font style="font-size:23px;"><u>LOAD</font>

<font size=5><b>MySQL Database 
    <br>
    <font size=4><b>PyMySQL and SQLAlchemy

In [13]:
# PyMySQL
import pymysql
pymysql.install_as_MySQLdb()

# SQLAlchemy
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

<font size=4><b>Connecting to SQL Server

In [14]:
## loading mysql credentials
with open('/Users/sugan/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [15]:
## creating connection to database with sqlalchemy
database  = "movies"
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database}"

<font size=4><b>Creating the Engine

In [16]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

<font size=4><b>New Database Creation & Verification

In [17]:
# Database Creation & Verification
if database_exists(connection):
    print('Database Exists!')
else:
    create_database(connection)
    if database_exists(connection):
        print('Database Created!')

Database Created!

<font size=4><b>SQL Datatype Schema

In [18]:
## DATATYPE SCHEMA(Only for tables with string primary key)
## BASICS
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "runtimeMinutes":Integer()}

## RATINGS
key_len2 = title_ratings['tconst'].fillna('').map(len).max()
ratings_schema = {
    "tconst": String(key_len2+1), 
    "averageRating": Float(),
    "numVotes":Integer()}

## TMDB
key_len3 = tmdb_data['imdb_id'].fillna('').map(len).max()
rating_len = tmdb_data['certification'].fillna('').map(len).max()
tmdb_schema = {
    "imdb_id": String(key_len3+1), 
    "revenue": Float(),
    "budget":Float(),
    "certification":Text(rating_len+1)}

<font size=4><b>Adding PANDAS Dataframes as Tables to MySQL Database

In [19]:
# DATAFRAMES AS TABLES
# String Primary Key
title_basics.to_sql('title_basics', engine, dtype=basics_schema, if_exists='replace', index=False)
title_ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace', index=False)
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

# Numerics or No Primary Key
genres.set_index('genre_id').to_sql('genres',engine,index=True)
title_genres.to_sql('title_genres', engine, if_exists='replace', index=False)

158833

<font size=4><b>ADD PRIMARY KEY

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

<font size=4><b>TABLES: First 5 Rows

In [21]:
# TITLE_BASICS
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [22]:
# TITLE_RATINGS
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1949
1  tt0000002            5.8       264
2  tt0000005            6.2      2583
3  tt0000006            5.1       177
4  tt0000007            5.4       810

In [23]:
# TITLE_GENRES
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [24]:
# GENRES
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [26]:
# TMDB_DATA
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0118589   5271670.0  22000000.0         PG-13
4  tt0118652         0.0   1000000.0             R

<br><font size=4><b>SHOW TABLES

In [27]:
# QUERYING
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

<div style="background-color:#0d253f;height: 140px;position:relative;
  width: 100%;margin-left:-5px;"><img style="margin:15px;" src="https://www.themoviedb.org/assets/2/v4/logos/v2/blue_square_2-d537fb228cf3ded904ef09b136fe3fec72548ebc1fea3fbbd1ad9e36364db38b.svg" align="left" width=154 height=20 alt="My Image" /><span style="display:inline-block;float:right;color:#01b4e4;position:absolute;bottom:10px;right:10px;opacity:.6;">Information courtesy of IMDb (<a href="https://www.imdb.com/">https://www.imdb.com</a>). Used with permission.</span></div>